Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: You can also use Wiremock to mock the authorization OAuth2 and OIDC services: See xref:security-oauth2.adoc#integration-testing[OAuth2 Integration testing], xref:security-oidc-bearer-token-authentication.adoc#integration-testing-wiremock[OpenID Connect Bearer Token Integration testing], xref:security-oidc-code-flow-authentication.adoc#integration-testing-wiremock[OpenID Connect Authorization Code Flow Integration testing] and xref:security-jwt.adoc#integration-testing-wiremock[SmallRye JWT Integration testing] for more details.
ja_jp: Wiremockを使用して認可OAuth2とOIDCサービスをモックすることもできます：詳細は xref:security-oauth2.adoc#integration-testing[OAuth2統合テスト] 、 xref:security-oidc-bearer-token-authentication.adoc#integration-testing-wiremock[OpenID Connect Bearer Token統合テスト] 、 xref:security-oidc-code-flow-authentication.adoc#integration-testing-wiremock[OpenID Connect 認可コードフロー統合テスト] 、 xref:security-jwt.adoc#integration-testing-wiremock[SmallRye JWT統合テスト] を参照してください。

source: You can also use Wiremock to mock the authorization OAuth2 and OIDC services: See xref:security-oauth2.adoc#integration-testing[OAuth2 Integration testing], xref:security-openid-connect.adoc#integration-testing-wiremock[OpenID Connect Bearer Token Integration testing], xref:security-openid-connect-web-authentication.adoc#integration-testing-wiremock[OpenID Connect Authorization Code Flow Integration testing] and xref:security-jwt.adoc#integration-testing-wiremock[SmallRye JWT Integration testing] for more details.
ja_jp: また、Wiremockを使って認可用のOAuth2やOIDCサービスをモックすることもできます。詳細は、 xref:security-oauth2.adoc#integration-testing[OAuth2 Integration testing]、あるいは xref:security-openid-connect.adoc#integration-testing-wiremock[OpenID Connect Bearer Token Integration testing]、 xref:security-openid-connect-web-authentication.adoc#integration-testing-wiremock[OpenID Connect Authorization Code Flow Integration testing]、 xref:security-jwt.adoc#integration-testing-wiremock[SmallRye JWT Integration testing] を参照してください。

source: You can also use `@RegisterClientHeaders` annotation without any custom factory specified. In that case the `DefaultClientHeadersFactoryImpl` factory will be used and all headers listed in `org.eclipse.microprofile.rest.client.propagateHeaders` configuration property will be amended. Individual header names are comma-separated.
ja_jp: また、カスタムファクトリーを指定せずに `@RegisterClientHeaders` アノテーションを使用することもできます。その場合は、 `DefaultClientHeadersFactoryImpl` ファクトリーが使用され、 `org.eclipse.microprofile.rest.client.propagateHeaders` 設定プロパティに記載されているすべてのヘッダーが修正されます。個々のヘッダー名はコンマで区切られています。

source: You can also use `KeycloakTestResourceLifecycleManager` for integration testing with Keycloak.
ja_jp: Keycloak との結合テストには `KeycloakTestResourceLifecycleManager` を使用することもできます。

source: You can also use `OidcTestClient` to test Quarkus endpoints supported by xref:security-openid-connect-dev-services.adoc#dev-services-for-oidc[Dev Services for OIDC]. No configuration in the `application.properties` file is needed, Quarkus will configure `OidcTestClient` for you:
ja_jp: また、 `OidcTestClient` を使用して、xref:security-openid-connect-dev-services.adoc#dev-services-for-oidc[OIDC 用 Dev Services] でサポートされている Quarkus エンドポイントをテストすることもできます。 `application.properties` ファイルでの設定は必要ありません。Quarkus が `OidcTestClient` を設定します。

source: You can also use `io.smallrye.jwt.util.KeyUtils` to generate a pair of asymmetric RSA or EC keys. These keys can be stored in `JWK`, `JWK Set`, or `PEM` format.
ja_jp: `io.smallrye.jwt.util.KeyUtils` を使用して、非対称 RSA または EC キーのペアを生成することもできます。これらのキーは、 `JWK` 、 `JWK Set` 、または `PEM` 形式を使用して保存できます。

source: You can also use a configuration file to register classes for reflection, if you prefer relying on the GraalVM infrastructure.
ja_jp: また、GraalVMインフラストラクチャに依存することを好むなら、リフレクションのためにクラスを登録するために設定ファイルを使用することもできます。

source: You can also use a local inlined public key for testing your `quarkus-oidc` `service` applications:
ja_jp: また、 `quarkus-oidc` `service` アプリケーションのテストに、ローカルのインライン公開鍵を使用することもできます。

source: You can also use a simplified format, starting with a number:
ja_jp: 数字で始まる簡略化した書式を使うこともできます:

source: You can also use another Java runtime supported by App Engine, for example, for Java 17, use `runtime: java17` instead.
ja_jp: App Engineがサポートする別のJavaランタイムを使用することもできます。たとえば、Java 17の場合は、代わりに `runtime: java17` が使用できます。

source: You can also use any component in the Qomponent library, described below
ja_jp: 以下で説明する Qomponent ライブラリーの任意のコンポーネントを使用することもできます。

source: You can also use any of the JAX-RS annotations link:{jaxrsapi}/javax/ws/rs/PathParam.html[`@PathParam`], link:{jaxrsapi}/javax/ws/rs/QueryParam.html[`@QueryParam`], link:{jaxrsapi}/javax/ws/rs/HeaderParam.html[`@HeaderParam`], link:{jaxrsapi}/javax/ws/rs/CookieParam.html[`@CookieParam`], link:{jaxrsapi}/javax/ws/rs/FormParam.html[`@FormParam`] or link:{jaxrsapi}/javax/ws/rs/MatrixParam.html[`@MatrixParam`] for this, but they require you to specify the parameter name.
ja_jp: JAX-RS のアノテーションも使用できます。link:{jaxrsapi}/javax/ws/rs/PathParam.html[`@PathParam`]、link:{jaxrsapi}/javax/ws/rs/QueryParam.html[`@QueryParam`]、link:{jaxrsapi}/javax/ws/rs/HeaderParam.html[`@HeaderParam`]、link:{jaxrsapi}/javax/ws/rs/CookieParam.html[`@CookieParam`]、link:{jaxrsapi}/javax/ws/rs/FormParam.html[`@FormParam`] または link:{jaxrsapi}/javax/ws/rs/MatrixParam.html[`@MatrixParam`]。しかし、パラメーター名の指定が必要です。

source: You can also use any of the Jakarta REST annotations link:{jaxrsapi}/jakarta/ws/rs/PathParam.html[`@PathParam`], link:{jaxrsapi}/jakarta/ws/rs/QueryParam.html[`@QueryParam`], link:{jaxrsapi}/jakarta/ws/rs/HeaderParam.html[`@HeaderParam`], link:{jaxrsapi}/jakarta/ws/rs/CookieParam.html[`@CookieParam`], link:{jaxrsapi}/jakarta/ws/rs/FormParam.html[`@FormParam`] or link:{jaxrsapi}/jakarta/ws/rs/MatrixParam.html[`@MatrixParam`] for this, but they require you to specify the parameter name.
ja_jp: これについては、link:{jaxrsapi}/jakarta/ws/rs/PathParam.html[`@PathParam`]、 link:{jaxrsapi}/jakarta/ws/rs/QueryParam.html[`@QueryParam`]、 link:{jaxrsapi}/jakarta/ws/rs/HeaderParam.html[`@HeaderParam`]、 link:{jaxrsapi}/jakarta/ws/rs/CookieParam.html[`@CookieParam`]、 link:{jaxrsapi}/jakarta/ws/rs/FormParam.html[`@FormParam`] または link:{jaxrsapi}/jakarta/ws/rs/MatrixParam.html[`@MatrixParam`] の Jakarta REST アノテーションリンクを使用することもできますが、 パラメーター名を指定する必要があります。

source: You can also use different permissions for different paths or use role bindings:
ja_jp: また、パスごとに異なる権限を使用したり、ロールバインディングを使用したりすることも可能です:

source: You can also use it to customize how the token is verified or decrypted. For example, one can supply a local `SecretKey`:
ja_jp: また、トークンの検証方法や復号化方法をカスタマイズするためにも使用できます。 たとえば、ローカルの `SecretKey` を指定できます。

source: You can also use it to customize the way the token is verified or decrypted. For example, one can supply a local `SecretKey`:
ja_jp: これを使用して、トークンの検証または復号化の方法をカスタマイズすることもできます。たとえば、ローカルの `SecretKey` を指定できます。

source: You can also use one of our reactive SQL client instead of the JDBC client. To do so with Cloud SQL, add the following dependency (adjust the classifier depending on your platform):
ja_jp: JDBCクライアントの代わりに、私達のリアクティブSQLクライアントの1つを使用することもできます。Cloud SQLでこれを行うには、以下の依存関係を追加してください（プラットフォームに応じて分類子を調整してください）。

source: You can also use the CQLSH utility to interactively interrogate your database:
ja_jp: CQLSH ユーティリティーを使用して、データベースに対話式に問い合わせることもできます。

source: You can also use the CSS var `--quarkus-assistant` anywhere you want to apply the assistant's theme color.
ja_jp: アシスタントのテーマカラーを適用したい場所であればどこでも、 CSS 変数 `--quarkus-assistant` を使用することもできます。

source: You can also use the JAX-RS type link:{jaxrsapi}/javax/ws/rs/core/Response.html[`Response`] but it is not strongly typed to your entity.
ja_jp: また、JAX-RS タイプの link:{jaxrsapi}/javax/ws/rs/core/Response.html[`レスポンス`] を使用することもできますが、エンティティーに強く型付けされるわけではありません。

source: You can also use the Jakarta REST type link:{jaxrsapi}/jakarta/ws/rs/core/Response.html[`Response`] but it is not strongly typed to your entity.
ja_jp: また、Jakarta REST型 link:{jaxrsapi}/jakarta/ws/rs/core/Response.html[`Response`] を使用することもできますが、 エンティティーに対して厳密に型指定されていません。

source: You can also use the `@CurrentThreadContext` annotation to control which contexts are propagated. The following example shows how to avoid propagating any context to the message processing stage:
ja_jp: また、`@CurrentThreadContext` アノテーションを使用して、伝搬するコンテキストを制御することもできます。次の例は、メッセージ処理ステージにコンテキストを伝搬しない方法を示しています。

source: You can also use the `TlsConfiguration` object to configure the Vert.x client or server, such as `KeyCertOptions`, `TrustOptions`, and so on.
ja_jp: また、`TlsConfiguration` オブジェクトを使用して、`KeyCertOptions`、`TrustOptions` などの Vert.x クライアントまたはサーバーを設定することもできます。

source: You can also use the `application.yaml` file. For this, you need to _add_ it to the `application.yaml` file to the script and include the `quarkus-config-yaml` dependency:
ja_jp: `application.yaml` ファイルを使用することもできます。 このためには、スクリプトの `application.yaml` ファイルにそれを _追加_ し、 `quarkus-config-yaml` 依存関係を含める必要があります。

source: You can also use the `setup` attribute on the `@WithKubernetesTestServer` annotation to provide a class that will configure the `KubernetesServer` instance:
ja_jp: また、 `@WithKubernetesTestServer` アノテーションの `setup` 属性を使用して、 `KubernetesServer` インスタンスを設定するクラスを提供することもできます。

source: You can also use the default gRPC API instead of Mutiny:
ja_jp: また、Mutinyの代わりにデフォルトのgRPC APIを使用することもできます。

source: You can also use the deprecated `quarkus.mailer.trust-all=true` property.
ja_jp: 非推奨の `quarkus.mailer.trust-all=true` プロパティーを使用することもできます。

source: You can also use the following operators in a condition:
ja_jp: 条件では、以下の演算子を使うこともできます:

source: You can also use the new Java 17 runtime by defining `runtime: java17` instead.
ja_jp: 代わりに `runtime: java17` を定義することで、新しい Java 17 ランタイムを使用することもできます。

source: You can also use the new Java 17 runtime by using `--runtime=java17` in the gcloud command line.
ja_jp: また、gcloudのコマンドラインで `--runtime=java17` を使用すると、新しいJava 17ランタイムを使用することができます。

source: You can also use the reactive variants by returning `Uni` types from your repository methods, or add other types of repositories in your entity to support managed entities.
ja_jp: リポジトリメソッドから `Uni` 型を返すことでリアクティブなバリアントを使用することもできますし、マネージドエンティティをサポートするために、エンティティに他のタイプのリポジトリを追加することもできます。

source: You can also use the value from another field to add a new environment variable by specifying the path of the field to be used as a source. For example:
ja_jp: ソースとして使用するフィールドのパスを指定することで、他のフィールドの値を使用して新しい環境変数を追加することもできます。 例:

source: You can also use the xref:logging-exporter-for-debugging[logging exporter] to output all traces and metrics to the console.
ja_jp: xref:logging-exporter-for-debugging[ロギングエクスポーター] を使用して、すべてのトレースとメトリクスをコンソールに出力することもできます。

source: You can also use this to configure the current user that the test will run as:
ja_jp: これを使用して、テストを実行する現在のユーザーを設定することもできます:

source: You can also verify that there are no more active instances
ja_jp: アクティブなインスタンスがないことを確認することもできます。

source: You can also verify that there is active instance
ja_jp: アクティブなインスタンスがあることを確認することもできます。

source: You can also write your queries in plain link:https://docs.jboss.org/hibernate/orm/5.4/userguide/html_single/Hibernate_User_Guide.html#hql[HQL]:
ja_jp: また、クエリーをプレーンな link:https://docs.jboss.org/hibernate/orm/5.4/userguide/html_single/Hibernate_User_Guide.html#hql[HQL]で書くこともできます:

source: You can also write your queries in plain link:{hibernate-orm-docs-url}#hql[HQL]:
ja_jp: また、プレーンな link:{hibernate-orm-docs-url}#hql[HQL] でクエリを記述することもできます：

source: You can always explicitly write delete methods as query methods.
ja_jp: 削除メソッドは常にクエリメソッドとして明示的に記述できます。

source: You can always implement one or more `GrpcSecurityMechanism` bean if above-mentioned mechanisms provided by Quarkus do no meet your needs.
ja_jp: Quarkus が提供する上記のメカニズムがニーズを満たさない場合は、いつでも 1 つ以上の `GrpcSecurityMechanism` Bean を実装できます。

source: You can always register `SecurityIdentityAugmentor` if the automatic <<map-certificate-attributes-to-roles>> option does not suit. Custom `SecurityIdentityAugmentor` can check the values of different client certificate attributes and augment the `SecurityIdentity` accordingly.
ja_jp: 自動の <<map-certificate-attributes-to-roles>> オプションが適切でない場合は、いつでも `SecurityIdentityAugmentor` を登録できます。 カスタム `SecurityIdentityAugmentor` は、さまざまなクライアント証明書属性の値をチェックし、それに応じて `SecurityIdentity` を拡張できます。

source: You can and should check the logs to see if your application is now indeed running from the container:
ja_jp: アプリケーションが実際にコンテナーから実行されているかどうか、ログを確認することができますし、確認すべきです。

source: You can annotate a route method with `@io.smallrye.common.annotation.RunOnVirtualThread` in order to execute it on a virtual thread. However, keep in mind that not everything can run safely on virtual threads. You should read the xref:virtual-threads.adoc#run-code-on-virtual-threads-using-runonvirtualthread[Virtual thread support reference] carefully and get acquainted with all the details.
ja_jp: 仮想スレッド上で実行するために、ルートメソッドに `@io.smallrye.common.annotation.RunOnVirtualThread` のアノテーションを付けることができます。しかし、すべてが仮想スレッド上で安全に実行できるわけではないことに注意してください。 xref:virtual-threads.adoc#run-code-on-virtual-threads-using-runonvirtualthread[仮想スレッドサポートのリファレンス] をよく読んで、すべての詳細を理解してください。

source: You can annotate an injected field/parameter with `@io.quarkus.runtime.annotations.StaticInitSafe` to mark the injected configuration object as safe to be initialized during the static initialization phase.
ja_jp: 注入されたフィールド/パラメータに `@io.quarkus.runtime.annotations.StaticInitSafe` のアノテーションを付けることで、静的初期化フェーズで注入された設定オブジェクトを安全に初期化できるようにマークすることができます。

source: You can apply asynchronous stream processing by consuming and returning reactive stream `Multi<T>` type:
ja_jp: リアクティブストリーム `Multi<T>` タイプを消費して返すことにより、非同期ストリーム処理を適用できます。

source: You can apply extension codestarts in the Quarkus tooling:
ja_jp: エクステンションcodestartは、Quarkusのツールで適用できます。

source: You can assign a `org.hibernate.engine.jdbc.spi.StatementInspector` to your `SessionFactory` by simply defining a CDI bean with the appropriate qualifier:
ja_jp: 適切な修飾子を持つCDI Beanを定義するだけで、 `SessionFactory` に `org.hibernate.engine.jdbc.spi.StatementInspector` を割り当てることができます:

source: You can assign an link:{hibernate-orm-docs-url}#events-interceptors[`org.hibernate.Interceptor`] to your `SessionFactory` by simply defining a CDI bean with the appropriate qualifier:
ja_jp: 適切な修飾子を持つ CDI Bean を定義するだけで、link:{hibernate-orm-docs-url}#events-interceptors[`org.hibernate.Interceptor`] を `SessionFactory` に割り当てることができます。

source: You can assign an link:{orm-doc-url-prefix}#events-interceptors[`org.hibernate.Interceptor`] to your `SessionFactory` by simply defining a CDI bean with the appropriate qualifier:
ja_jp: link:{orm-doc-url-prefix}#events-interceptors[`org.hibernate.Interceptor`]を `SessionFactory` に割り当てるには、適切な修飾子を持つ CDI Bean を定義するだけです:

source: You can associate tags to the collected metrics by setting the following properties in your `application.properties`:
ja_jp: `application.properties` で次のプロパティーを設定することで、収集されたメトリクスにタグを関連付けできます。

source: You can attach a link:https://docs.oracle.com/en/java/javase/17/docs/api/java.logging/java/util/logging/Filter.html[filter] to a log handler such as the console handler. The filter determines whether the handler logs a given log record.
ja_jp: コンソールハンドラーなどのログハンドラーに link:https://docs.oracle.com/en/java/javase/17/docs/api/java.logging/java/util/logging/Filter.html[フィルター] をアタッチできます。フィルターは、ハンドラーが特定のログレコードを記録するかどうかを決定します。

source: You can attach several packages to a persistence unit:
ja_jp: 複数のpackageを永続化ユニットにアタッチできます:

source: You can avoid manually entering the service paths and test your service with Swagger UI or GraphQL UI if `quarkus-smallrye-openapi` or `quarkus-smallrye-graphql` are used in your project. For example, start Quarkus in dev mode with both `quarkus-smallrye-openapi` and `quarkus-smallrye-graphql` dependencies. You can see the following options after logging in to Keycloak:
ja_jp: プロジェクトで `quarkus-smallrye-openapi` または `quarkus-smallrye-graphql` が使用されている場合は、サービスパスを手動で入力する必要がなくなり、Swagger UI または GraphQL UI を使用してサービスをテストできます。 たとえば、`quarkus-smallrye-openapi` と `quarkus-smallrye-graphql` の両方の依存関係を使用して Quarkus を開発モードで起動します。 Keycloak にログインすると、次のオプションが表示されます。

source: You can avoid manually entering the service paths and test your service with `Swagger UI` or `GraphQL UI` if `quarkus-smallrye-openapi` and/or `quarkus-smallrye-graphql` are used in your project. For example, if you start Quarkus in dev mode with both `quarkus-smallrye-openapi` and `quarkus-smallrye-graphql` dependencies then you will see the following options after logging in into Keycloak:
ja_jp: プロジェクトで `quarkus-smallrye-openapi` や `quarkus-smallrye-graphql` が使用されている場合、サービスパスを手動で入力することを避け、 `Swagger UI` または `GraphQL UI` を使用してサービスをテストできます。たとえば、 `quarkus-smallrye-openapi` と `quarkus-smallrye-graphql` の両方の依存関係を使用して開発モードで Quarkus を起動すると、Keycloak にログインした後に次のオプションが表示されます。

source: You can begin testing by adding the following dependencies to your test project:
ja_jp: 次の依存関係をテストプロジェクトに追加することで、テストを開始できます。

source: You can bind custom named `HttpSecurityPolicy` to a WebSocket endpoint with the `@AuthorizationPolicy` security annotation. The `@AuthorizationPolicy` security annotation can only be used to secure the HTTP upgrade, thus placing this annotation on WebSocket endpoint methods fails the build during the validation.
ja_jp: カスタム名の `HttpSecurityPolicy` を、`@AuthorizationPolicy` セキュリティーアノテーションを使用して WebSocket エンドポイントにバインドできます。`@AuthorizationPolicy` セキュリティーアノテーションは、HTTP アップグレードを保護するためにのみ使用できるため、このアノテーションを WebSocket エンドポイントメソッドに配置すると、検証中にビルドが失敗します。

source: You can browse and see the full list at http://quarkus.io/insights/.
ja_jp: http://quarkus.io/insights/ で全リストを閲覧・確認できます。

source: You can build a native executable with the usual command `./mvnw package -Pnative`.
ja_jp: ネイティブ実行可能ファイルは、通常のコマンド `./mvnw package -Pnative` でビルドできます。

source: You can build a native executable with the usual command:
ja_jp: 以下のコマンドでネイティブ実行可能ファイルをビルドすることができます。

source: You can build a native executable with:
ja_jp: 以下でネイティブ実行可能ファイルをビルドできます。

source: You can build and deploy by using any of the following deployment options:
ja_jp: 以下のデプロイオプションのいずれかを使用して、ビルドとデプロイを行うことができます：

source: You can build the application with:
ja_jp: 次のコマンドでアプリケーションをビルドできます。

source: You can build the image or let docker-compose build it for you.
ja_jp: イメージをビルドするか、docker-composeにビルドを任せることができます。

source: You can build the native executable with:
ja_jp: 以下でネイティブ実行可能ファイルをビルドすることができます:

source: You can call the method (optionally passing in parameters) and then provide the code that will be called on the next event.
ja_jp: メソッドを呼び出し (オプションでパラメーターを渡す)、次のイベントで呼び出されるコードを提供できます。

source: You can change `failBuildOnCVSS` value to detect less severe issues as well.
ja_jp: `failBuildOnCVSS` の値を変更することで、それほど深刻でない問題を検出することもできます。

source: You can change any styling element in this css file, you need to place this file called `style.css` in `src/main/resources/META-INF/branding`.
ja_jp: このCSSファイルの中で、任意のスタイル要素を変更することができます。 `style.css` というファイルを `src/main/resources/META-INF/branding` に配置する必要があります。

source: You can change the Generated OpenAPI Schema using one or more filter. Filters can run during build time, or at runtime.
ja_jp: 生成された OpenAPI スキーマは、1 つ以上のフィルターを使用して変更できます。フィルターは、ビルド時または実行時に実行できます。

source: You can change the log level of the thrown `WebApplicationException` exceptions by configuring the following property `quarkus.log.category."WebApplicationException".level` like so:
ja_jp: 出力された ` WebApplicationException ` 例外のログレベルを変更するには、次のようにプロパティー `quarkus.log.category."WebApplicationException".level` を設定します。

source: You can change the theme by setting the `quarkus.swagger-ui.theme` property, for example:
ja_jp: 例えば、 `quarkus.swagger-ui.theme` プロパティーを設定することでテーマを変更することができます:

source: You can change the working directory the development environment runs on:
ja_jp: 開発環境が動作する作業ディレクトリーを変更することができます:

source: You can change this behavior by setting the `quarkus.compose.devservices.reuse-project-for-tests=true` property. This allows tests to reuse services started separately in development mode.
ja_jp: この動作は、`quarkus.compose.devservices.reuse-project-for-tests=true` プロパティーを設定することで変更できます。これにより、テストは開発モードで個別に起動されたサービスを再利用できます。

source: You can check if implementing single-page applications (SPAs) the way it is suggested in the xref:security-oidc-bearer-token-authentication.adoc#single-page-applications[Single-page applications] section of the "OpenID Connect (OIDC) Bearer token authentication" guide meets your requirements.
ja_jp: 「OpenID Connect (OIDC) ベアラートークン認証」ガイドの xref:security-oidc-bearer-token-authentication.adoc#single-page-applications[シングルページアプリケーション] セクションで提案されている方法でシングルページアプリケーション (SPA) を実装した場合、要件が満たされるか確認できます。

source: You can check if this is the first execution (not a live reload).
ja_jp: これが最初の実行であるかどうか (ライブリロードではないかどうか) を確認できます。

source: You can check the Swagger UI path in your application's log:
ja_jp: アプリケーションのログでSwaggerのUIパスを確認することができます。

source: You can check the code of the example in https://github.com/michalszynkiewicz/rest-client-reactive-stork/tree/kubernetes[this repo] for the client-side, and https://github.com/michalszynkiewicz/configurable-rest-service/tree/kubernetes[this one] for the HTTP service.
ja_jp: クライアント側は link:https://github.com/michalszynkiewicz/rest-client-reactive-stork/tree/kubernetes[このレポジトリ]で、HTTPサービス側は link:https://github.com/michalszynkiewicz/configurable-rest-service/tree/kubernetes[このレポジトリ]で、それぞれサンプルのコードを確認できます。

source: You can check the schemas that exist under the `Schemas` tab by logging into Infinispan Console at `http://SERVER_HOST:SERVER_PORT` (for example `http://localhost:11222`).
ja_jp: Infinispan コンソールにログインし、 `http://SERVER_HOST:SERVER_PORT`（例: `http://localhost:11222` )の `Schemas` タブに存在するスキーマを確認することができます。

source: You can check the schemas that exist under the `Schemas` tab by logging into Infinispan Console at `http://localhost:11222`
ja_jp: Infinispan コンソールにログインして `http://localhost:11222` にアクセスすると、 `Schemas` タブに存在するスキーマを確認することができます

source: You can check whether implementing single-page applications (SPAs) as suggested in the xref:security-oidc-bearer-token-authentication.adoc#single-page-applications[Single-page applications] section of the "OpenID Connect (OIDC) Bearer token authentication" guide meets your requirements.
ja_jp: 「OpenID Connect (OIDC) ベアラートークン認証」ガイドの xref:security-oidc-bearer-token-authentication.adoc#single-page-applications[シングルページアプリケーション] セクションで提案されているように、シングルページアプリケーション (SPA) の実装が要件を満たしているかどうかを確認できます。

source: You can check whether the workaround has been previously applied to your system with the following command:
ja_jp: 回避策が以前にシステムに適用されているかどうかは、次のコマンドで確認できます。

source: You can choose WebSocket endpoints to which the `HttpUpgradeCheck` is applied with the `HttpUpgradeCheck#appliesTo` method.
ja_jp: `HttpUpgradeCheck#appliesTo` メソッドを使用して、 `HttpUpgradeCheck` を適用する WebSocket エンドポイントを選択できます。

source: You can choose a column length depending on the length of your tokens.
ja_jp: トークンの長さに応じて列の長さを選択できます。

source: You can choose among three strategies:
ja_jp: 3つの戦略から選択することができます:

source: You can choose to extend the `WithId.AutoString` for a `String` identifier, or `WithId.AutoUUID` for a `UUID` identifier, or even extend `WithId<IdType>` to automatically get an attribute of the form:
ja_jp: `String` 識別子には `WithId.AutoString` を、`UUID` 識別子には `WithId.AutoUUID` を拡張することもできますし、`WithId<IdType>` を拡張して次の形式の属性を自動的に取得することもできます。

source: You can choose to let `gcloud` build your application for you, this is the simplest way to deploy to App Engine.
ja_jp: `gcloud` にアプリケーションをビルドさせることができます。これは App Engine にデプロイする最もシンプルな方法です。
